FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
/* @brief Specifies the SMPU hardware and definition revision level */
#define FEATURE_SMPU_HARDWARE_REVISION_LEVEL (4U)
/* @brief Specifies the SMPU has process identifier feature */
#define FEATURE_SMPU_HAS_PROCESS_IDENTIFIER  (1U)
/* @brief Specifies the SMPU has owner lock feature */
#define FEATURE_SMPU_HAS_OWNER_LOCK          (1U)
/* @brief Specifies the SMPU has specific access feature */
#define FEATURE_SMPU_HAS_SPECIFIC_ACCESS_RIGHT_COUNT (3U)
/* @brief Specifies the end address reset value */
#define FEATURE_SMPU_END_ADDRESS_RESET_VALUE (0xFU)
/* @brief Specifies the highest bus master */
#define FEATURE_SMPU_MAX_MASTER_NUMBER       (15U)
/* @brief Specifies total number of bus masters */
#define FEATURE_SMPU_MASTER_COUNT            (15U)
/* @brief The SMPU Logical Bus Master Number for Core Z4a master */
#define FEATURE_SMPU_MASTER_CORE_Z4A         (0U)
/* @brief The SMPU Logical Bus Master Number for Core Z4b master */
#define FEATURE_SMPU_MASTER_CORE_Z4B         (1U)
/* @brief The SMPU Logical Bus Master Number for Core Z2 master */
#define FEATURE_SMPU_MASTER_CORE_Z2          (2U)
/* @brief The SMPU Logical Bus Master Number for Hardware Security Mode master */
#define FEATURE_SMPU_MASTER_HSM              (3U)
/* @brief The SMPU Logical Bus Master Number for Enhanced Direct Memory Access master */
#define FEATURE_SMPU_MASTER_EDMA             (4U)
/* @brief The SMPU Logical Bus Master Number for Ethernet 0 master */
#define FEATURE_SMPU_MASTER_ENET0            (5U)
/* @brief The SMPU Logical Bus Master Number for FlexRay master */
#define FEATURE_SMPU_MASTER_FLEXRAY          (6U)
/* @brief The SMPU Logical Bus Master Number for Media Local Bus master */
#define FEATURE_SMPU_MASTER_MLB              (7U)
/* @brief The SMPU Logical Bus Master Number for Debugger Z4a master */
#define FEATURE_SMPU_MASTER_DEBUG_Z4A        (8U)
/* @brief The SMPU Logical Bus Master Number for Debugger Z4b master */
#define FEATURE_SMPU_MASTER_DEBUG_Z4B        (9U)
/* @brief The SMPU Logical Bus Master Number for Debugger Z2 master */
#define FEATURE_SMPU_MASTER_DEBUG_Z2         (10U)
/* @brief The SMPU Logical Bus Master Number for Universal Serial Bus 0 master */
#define FEATURE_SMPU_MASTER_USB0             (11U)
/* @brief The SMPU Logical Bus Master Number for Universal Serial Bus 1 master */
#define FEATURE_SMPU_MASTER_USB1             (12U)
/* @brief The SMPU Logical Bus Master Number for Secure Digital Host Controller master */
#define FEATURE_SMPU_MASTER_USDHC            (13U)
/* @brief The SMPU Logical Bus Master Number for Ethernet 1 master */
#define FEATURE_SMPU_MASTER_ENET1            (14U)
/* @brief The SMPU Logical Bus Masters */
#define FEATURE_SMPU_MASTER                      \
{                                                \
FEATURE_SMPU_MASTER_CORE_Z4A,  /* CORE Z4A */    \
FEATURE_SMPU_MASTER_CORE_Z4B,  /* CORE Z4B */    \
FEATURE_SMPU_MASTER_CORE_Z2,   /* CORE Z2 */     \
FEATURE_SMPU_MASTER_HSM,       /* HSM */         \
FEATURE_SMPU_MASTER_EDMA,      /* EDMA */        \
FEATURE_SMPU_MASTER_ENET0,     /* ENET 0 */      \
FEATURE_SMPU_MASTER_FLEXRAY,   /* FLEXRAY */     \
FEATURE_SMPU_MASTER_MLB,       /* MLB */         \
FEATURE_SMPU_MASTER_DEBUG_Z4A, /* DEBUG Z4A */   \
FEATURE_SMPU_MASTER_DEBUG_Z4B, /* DEBUG Z4B */   \
FEATURE_SMPU_MASTER_DEBUG_Z2,  /* DEBUG Z2 */    \
FEATURE_SMPU_MASTER_USB0,      /* USB 0 */       \
FEATURE_SMPU_MASTER_USB1,      /* USB 1 */       \
FEATURE_SMPU_MASTER_USDHC,     /* USDHC */       \
FEATURE_SMPU_MASTER_ENET1,     /* ENET1 */       \
}

/* I2C module features */

/* @brief DMA instance used for I2C module */
#define I2C_DMA_INSTANCE                    (0U)

/* @brief DMA instance used for I2C module */
#define I2C_DMA_REQ                         {{(uint8_t)EDMA_REQ_I2C_0_TX,(uint8_t)EDMA_REQ_I2C_0_RX}, \
                                            {(uint8_t)EDMA_REQ_I2C_1_TX, (uint8_t)EDMA_REQ_I2C_1_RX}, \
                                            {(uint8_t)EDMA_REQ_I2C_2_TX, (uint8_t)EDMA_REQ_I2C_2_RX}, \
                                            {(uint8_t)EDMA_REQ_I2C_3_TX, (uint8_t)EDMA_REQ_I2C_3_RX}}

/* @brief Interrupt vectors for the I2C peripheral type */
#define I2C_IRQS                            {I2C0_IRQn, I2C1_IRQn, I2C2_IRQn, I2C3_IRQn}

/* @brief PCC clocks for I2C peripheral */
#define I2C_CLOCKS                          {IIC0_CLK, IIC1_CLK, IIC2_CLK, IIC3_CLK}

/* @brief SCL divider values */
#define NO_I2C_SCL_DIVIDERS                    71U

/* @brief SCL divider values */
#define I2C_SCL_DIVIDER                     {{0x0, 20U}, {0x1, 22U}, {0x2, 24U}, {0x3, 26U}, {0x4, 28U}, {0x5, 30U}, {0x9, 32U}, {0x6, 34U}, {0x0A, 36U}, {0x7, 40U}, \
                                            {0x0C, 44U}, {0x0D, 48U}, {0x43, 52U}, {0x0E, 56U}, {0x45, 60U}, {0x12, 64U}, {0x0F, 68U}, {0x13, 72U}, {0x14, 80U}, {0x15, 88U}, \
                                            {0x19, 96U}, {0x16, 104U}, {0x1A, 112U}, {0x85, 120U}, {0x17, 128U}, {0x4F, 136U}, {0x1C, 144U}, {0x1D, 160U}, {0x55, 176U}, \
                                            {0x1E, 192U}, {0x56, 208U}, {0x22, 224U}, {0x1F, 240U}, {0x23, 256U}, {0x8F, 272U}, {0x24, 288U}, {0x25, 320U}, {0x95, 352U}, \
                                            {0x26, 384U}, {0x96, 416U}, {0x2A, 448U}, {0x27, 480U}, {0x2B, 512U}, {0x2C, 576U}, {0x2D, 640U}, {0x2E, 768U}, {0x32, 896U}, \
                                            {0x2F, 960U}, {0x33, 1024U}, {0x34, 1152U}, {0x35, 1280U}, {0x36, 1536U}, {0x3A, 1792U}, {0x37, 1920U}, {0x3B, 2048U}, {0x3C, 2304U}, \
                                            {0x3D, 2560U}, {0x3E, 3072U}, {0x7A, 3584U}, {0x3F, 3840U}, {0x7B, 4096U}, {0x7C, 4608U}, {0x7D, 5120U}, {0x7E, 6144U}, {0xBA, 7168U}, \
                                            {0x7F, 7680U}, {0xBB, 8192U}, {0xBC, 9216U}, {0xBD, 10240U}, {0xBE, 12288U}, {0xBF, 15360U}}

/* CAN module features */

/* @brief Frames available in Rx FIFO flag shift */
#define FEATURE_CAN_RXFIFO_FRAME_AVAILABLE  (5U)
/* @brief Rx FIFO warning flag shift */
#define FEATURE_CAN_RXFIFO_WARNING          (6U)
/* @brief Rx FIFO overflow flag shift */
#define FEATURE_CAN_RXFIFO_OVERFLOW         (7U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN0 */
#define FEATURE_CAN0_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN1 */
#define FEATURE_CAN1_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN2 */
#define FEATURE_CAN2_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN3 */
#define FEATURE_CAN3_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN4 */
#define FEATURE_CAN4_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN5 */
#define FEATURE_CAN5_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN6 */
#define FEATURE_CAN6_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN7 */
#define FEATURE_CAN7_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for any of the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM              (96U)
/* @brief Array of maximum number of Message Buffers supported for payload size 8 for all the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM_ARRAY        { FEATURE_CAN0_MAX_MB_NUM, \
                                              FEATURE_CAN1_MAX_MB_NUM, \
                                              FEATURE_CAN2_MAX_MB_NUM, \
                                              FEATURE_CAN3_MAX_MB_NUM, \
                                              FEATURE_CAN4_MAX_MB_NUM, \
                                              FEATURE_CAN5_MAX_MB_NUM, \
                                              FEATURE_CAN6_MAX_MB_NUM, \
                                              FEATURE_CAN7_MAX_MB_NUM }
/* @brief Has PE clock source select (bit field CAN_CTRL1[CLKSRC]). */
#define FEATURE_CAN_HAS_PE_CLKSRC_SELECT            (1)
/* @brief Has Pretending Networking mode */
#define FEATURE_CAN_HAS_PRETENDED_NETWORKING        (1)
/* @brief Has Stuff Bit Count Enable Bit */
#define FEATURE_CAN_HAS_STFCNTEN_ENABLE             (0)
/* @brief Has ISO CAN FD Enable Bit */
#define FEATURE_CAN_HAS_ISOCANFDEN_ENABLE           (0)
/* @brief Has Message Buffer Data Size Region 1 */
#define FEATURE_CAN_HAS_MBDSR1                      (1)
/* @brief Has Message Buffer Data Size Region 2 */
#define FEATURE_CAN_HAS_MBDSR2                      (1)
/* @brief Has DMA enable (bit field MCR[DMA]). */
#define FEATURE_CAN_HAS_DMA_ENABLE                  (1)
/* @brief DMA hardware requests for all FlexCAN instances */
#define FEATURE_CAN_EDMA_REQUESTS           { EDMA_REQ_FlexCAN_0, EDMA_REQ_FlexCAN_1, \
                                              EDMA_REQ_FlexCAN_2, EDMA_REQ_FlexCAN_3, \
                                              EDMA_REQ_FlexCAN_4, EDMA_REQ_FlexCAN_5, \
                                              EDMA_REQ_FLEXCAN_6, EDMA_REQ_FlexCAN_7 }
/* @brief Maximum number of Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS_MAX_COUNT       (7U)
/* @brief Has Wake Up Irq channels (CAN_Wake_Up_IRQS_CH_COUNT > 0u) */
#define FEATURE_CAN_HAS_WAKE_UP_IRQ         (1U)
/* @brief Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS                 { CAN_ORed_00_03_MB_IRQS, \
                                              CAN_ORed_04_07_MB_IRQS, \
                                              CAN_ORed_08_11_MB_IRQS, \
                                              CAN_ORed_12_15_MB_IRQS, \
                                              CAN_ORed_16_31_MB_IRQS, \
                                              CAN_ORed_32_63_MB_IRQS, \
                                              CAN_ORed_64_95_MB_IRQS }
/*! @brief FlexCAN Embedded RAM address offset */
#define FEATURE_CAN_RAM_OFFSET              (0x00000080u)
/* @brief Has Self Wake Up mode */
#define FEATURE_CAN_HAS_SELF_WAKE_UP        (1)
/* @brief Has Flexible Data Rate */
#define FEATURE_CAN_HAS_FD                  (1)
/* @brief Clock name for the PE oscillator clock source */
#define FEATURE_CAN_PE_OSC_CLK_NAME         FXOSC_CLK

