FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
/* CRC module features */

/* @brief CRC module use for C55. */
#define FEATURE_CRC_DRIVER_HARD_POLYNOMIAL
/* @brief Default CRC read transpose */
#define FEATURE_CRC_DEFAULT_READ_TRANSPOSE      false
/* @brief Default CRC bit mode polynomial */
#define FEATURE_CRC_DEFAULT_POLYNOMIAL          CRC_BITS_16_CCITT
/* @brief Default CRC write transpose */
#define FEATURE_CRC_DEFAULT_WRITE_TRANSPOSE     CRC_TRANSPOSE_BITS
/* @brief Default seed value is 0xFFFFU */
#define FEATURE_CRC_DEFAULT_SEED                (0xFFFFU)
/* @brief CRC-8-H2F Autosar polynomial */
#define FEATURE_CRC_BITS_8_H2F

/* LINFlexD module features */

/* @brief LINFlexD separate interrupt lines for rx/tx/error. */
#define FEATURE_LINFLEXD_RX_TX_ERR_INT_LINES
/* @brief Clock names for LINFlexD */
#define LINFLEXD_CLOCK_NAMES {LIN0_CLK, LIN1_CLK, LIN2_CLK, LIN3_CLK, LIN4_CLK, LIN5_CLK, LIN6_CLK, LIN7_CLK, LIN8_CLK, \
                              LIN9_CLK, LIN10_CLK, LIN11_CLK, LIN12_CLK, LIN13_CLK, LIN14_CLK, LIN15_CLK, LIN16_CLK, LIN17_CLK}
/* @brief Address of the least significant byte in a 32-bit register (depends on endianess) */
#define FEATURE_LINFLEXD_LSB_ADDR(reg)  ((uint32_t)(&(reg)) + 3U)
/* @brief Address of the least significant word in a 32-bit register (depends on endianess) */
#define FEATURE_LINFLEXD_LSW_ADDR(reg)  ((uint32_t)(&(reg)) + 2U)
/* @brief LINFlexD instances have different memory maps, depending on the number of filters implemented */
#define FEATURE_LINFLEXD_HAS_DIFFERENT_MEM_MAP
/* @brief LINFlexD register layout with 0 filters implemented (instances 1-17) */
typedef struct {
  __IO uint32_t LINCR1;                            /**< LIN Control Register 1, offset: 0x0 */
  __IO uint32_t LINIER;                            /**< LIN Interrupt enable register, offset: 0x4 */
  __IO uint32_t LINSR;                             /**< LIN Status Register, offset: 0x8 */
  __IO uint32_t LINESR;                            /**< LIN Error Status Register, offset: 0xC */
  __IO uint32_t UARTCR;                            /**< UART Mode Control Register, offset: 0x10 */
  __IO uint32_t UARTSR;                            /**< UART Mode Status Register, offset: 0x14 */
  __IO uint32_t LINTCSR;                           /**< LIN Time-Out Control Status Register, offset: 0x18 */
  __IO uint32_t LINOCR;                            /**< LIN Output Compare Register, offset: 0x1C */
  __IO uint32_t LINTOCR;                           /**< LIN Time-Out Control Register, offset: 0x20 */
  __IO uint32_t LINFBRR;                           /**< LIN Fractional Baud Rate Register, offset: 0x24 */
  __IO uint32_t LINIBRR;                           /**< LIN Integer Baud Rate Register, offset: 0x28 */
  __IO uint32_t LINCFR;                            /**< LIN Checksum Field Register, offset: 0x2C */
  __IO uint32_t LINCR2;                            /**< LIN Control Register 2, offset: 0x30 */
  __IO uint32_t BIDR;                              /**< Buffer Identifier Register, offset: 0x34 */
  __IO uint32_t BDRL;                              /**< Buffer Data Register Least Significant, offset: 0x38 */
  __IO uint32_t BDRM;                              /**< Buffer Data Register Most Significant, offset: 0x3C */
  __IO uint32_t IFER;                              /**< Identifier Filter Enable Register, offset: 0x40 */
  __I  uint32_t IFMI;                              /**< Identifier Filter Match Index, offset: 0x44 */
  __IO uint32_t IFMR;                              /**< Identifier Filter Mode Register, offset: 0x48 */
  __IO uint32_t GCR;                               /**< Global Control Register, offset: 0x8C */
  __IO uint32_t UARTPTO;                           /**< UART Preset Timeout Register, offset: 0x90 */
  __I  uint32_t UARTCTO;                           /**< UART Current Timeout Register, offset: 0x94 */
  __IO uint32_t DMATXE;                            /**< DMA Tx Enable Register, offset: 0x98 */
  __IO uint32_t DMARXE;                            /**< DMA Rx Enable Register, offset: 0x9C */
} LINFlexD_0IFCR_Type;
/* @brief LINFlexD "instance-implemented filters" mapping */
#define FEATURE_LINFLEXD_INST_HAS_IFCR {true, false, false, false, false, false, false, false, false, \
                                        false, false, false, false, false, false, false, false, false}
/* @brief LINFlexD DMA support */
#define FEATURE_LINFLEXD_HAS_DMA_ENABLED
/* @brief LINFlexD DMA enabled instances */
#define FEATURE_LINFLEXD_INST_HAS_DMA {true, true, false, false, false, false, false, false, false, \
                                       false, false, false, false, false, false, false, false, false}


/* DMA module features */

/* @brief Number of DMA channels. */
#define FEATURE_DMA_CHANNELS (32U)
/* @brief Number of DMA virtual channels. */
#define FEATURE_DMA_VIRTUAL_CHANNELS ((uint32_t)FEATURE_DMA_CHANNELS * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief Number of DMA interrupt lines. */
#define FEATURE_DMA_CHANNELS_INTERRUPT_LINES (32U)
/* @brief Number of DMA virtual interrupt lines. */
#define FEATURE_DMA_VIRTUAL_CHANNELS_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_CHANNELS_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief Number of DMA error interrupt lines. */
#define FEATURE_DMA_ERROR_INTERRUPT_LINES (1U)
/* @brief Number of DMA virtual error interrupt lines. */
#define FEATURE_DMA_VIRTUAL_ERROR_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_ERROR_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief DMA module has error interrupt. */
#define FEATURE_DMA_HAS_ERROR_IRQ
/* @brief DMA module separate interrupt lines for each channel */
#define FEATURE_DMA_SEPARATE_IRQ_LINES_PER_CHN
/* @brief Conversion from channel index to DCHPRI index. */
#define FEATURE_DMA_CHN_TO_DCHPRI_INDEX(x) (x)
/* @brief DMA channel groups count. */
#define FEATURE_DMA_CHANNEL_GROUP_COUNT (2U)
/* @brief Clock name for DMA */
#define FEATURE_DMA_CLOCK_NAMES {DMA0_CLK}
/* @brief Macros defined for compatibility with ARM platforms */
#define DMA_TCD_CITER_ELINKYES_CITER_LE_MASK   DMA_TCD_CITER_ELINKYES_CITER_MASK
#define DMA_TCD_CITER_ELINKYES_CITER_LE_SHIFT  DMA_TCD_CITER_ELINKYES_CITER_SHIFT
#define DMA_TCD_CITER_ELINKYES_CITER_LE_WIDTH  DMA_TCD_CITER_ELINKYES_CITER_WIDTH
#define DMA_TCD_CITER_ELINKYES_CITER_LE(x)     DMA_TCD_CITER_ELINKYES_CITER(x)
/* @brief DMA channel width based on number of TCDs: 2^N, N=4,5,... */
#define FEATURE_DMA_CH_WIDTH (5U)
/* @brief DMA channel to instance */
#define FEATURE_DMA_VCH_TO_INSTANCE(x) 	((x) >> (uint32_t)FEATURE_DMA_CH_WIDTH)
/* @brief DMA virtual channel to channel */
#define FEATURE_DMA_VCH_TO_CH(x)        ((x) & ((uint32_t)FEATURE_DMA_CHANNELS - 1U))
/* @brief DMA supports the following particular transfer size: */
#define FEATURE_DMA_TRANSFER_SIZE_8B
#define FEATURE_DMA_TRANSFER_SIZE_32B


/* DMAMUX module features */

/* @brief Number of DMA channels. */
#define FEATURE_DMAMUX_CHANNELS (16U)
/* @brief Has the periodic trigger capability */
#define FEATURE_DMAMUX_HAS_TRIG (1)
/* @brief Conversion from request source to the actual DMAMUX channel */
#define FEATURE_DMAMUX_REQ_SRC_TO_CH(x) ((x) & DMAMUX_CHCFG_SOURCE_MASK)
/* @brief Mapping between request source and DMAMUX instance */
#define FEATURE_DMAMUX_REQ_SRC_TO_INSTANCE(x) (((uint8_t)x) >> (uint8_t)DMAMUX_CHCFG_SOURCE_WIDTH)
/* @brief Conversion from eDMA channel index to DMAMUX channel. */
#define FEATURE_DMAMUX_DMA_CH_TO_CH(x) ((x) & (FEATURE_DMAMUX_CHANNELS - 1U))
/* @brief Conversion from DMAMUX channel DMAMUX register index. */
#define FEATURE_DMAMUX_CHN_REG_INDEX(x) (x)
/* @brief Clock names for DMAMUX */
#define FEATURE_DMAMUX_CLOCK_NAMES {DMAMUX0_CLK, DMAMUX0_CLK}
/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum {
    EDMA_REQ_DISABLED_MUX0 = 0U,
    EDMA_REQ_ADC_0_MUX0 = 1U,
    EDMA_REQ_ADC_1_MUX0 = 2U,
    EDMA_REQ_CMP_0 = 3U,
    EDMA_REQ_BCTU_0 = 4U,
    EDMA_REQ_FlexCAN_0 = 5U,
    EDMA_REQ_FlexCAN_2 = 7U,
    EDMA_REQ_FlexCAN_4 = 9U,
    EDMA_REQ_SPI_0_TX = 12U,
    EDMA_REQ_SPI_0_RX = 13U,
    EDMA_REQ_SPI_0_CMD = 14U,
    EDMA_REQ_SPI_2_TX = 15U,
    EDMA_REQ_SPI_2_RX = 16U,
    EDMA_REQ_SPI_2_CMD = 17U,
    EDMA_REQ_SPI_4_TX = 18U,
    EDMA_REQ_SPI_4_RX = 19U,
    EDMA_REQ_SPI_4_CMD = 20U,
    EDMA_REQ_DSPI_0_TX = 21U,
    EDMA_REQ_DSPI_0_RX = 22U,
    EDMA_REQ_DSPI_0_CMD = 23U,
    EDMA_REQ_DSPI_0_DSI = 24U,
    EDMA_REQ_DSPI_2_TX = 25U,
    EDMA_REQ_DSPI_2_RX = 26U,
    EDMA_REQ_DSPI_2_CMD = 27U,
    EDMA_REQ_DSPI_2_DSI = 28U,
    EDMA_REQ_LIN_0_TX = 29U,
    EDMA_REQ_LIN_0_RX = 30U,
    EDMA_REQ_eMIOS_0_CH_A = 31U,
    EDMA_REQ_eMIOS_0_CH_B = 32U,
    EDMA_REQ_eMIOS_0_CH_C = 33U,
    EDMA_REQ_eMIOS_0_CH_D = 34U,
    EDMA_REQ_eMIOS_1_CH_A = 35U,
    EDMA_REQ_eMIOS_1_CH_B = 36U,
    EDMA_REQ_eMIOS_1_CH_C = 37U,
    EDMA_REQ_eMIOS_1_CH_D = 38U,
    EDMA_REQ_uSDHC = 39U,
    EDMA_REQ_I2C_0_TX = 40U,
    EDMA_REQ_I2C_0_RX = 41U,
    EDMA_REQ_I2C_2_TX = 42U,
    EDMA_REQ_I2C_2_RX = 43U,
    EDMA_REQ_CMP_2 = 44U,
    EDMA_REQ_FLEXCAN_6 = 45U,
    EDMA_REQ_eMIOS_2_CH_A = 47U,
    EDMA_REQ_eMIOS_2_CH_B = 48U,
    EDMA_REQ_eMIOS_2_CH_C = 49U,
    EDMA_REQ_eMIOS_2_CH_D = 50U,
    EDMA_REQ_SAI_0_TX = 51U,
    EDMA_REQ_SAI_0_RX = 52U,
    EDMA_REQ_SAI_2_TX = 53U,
    EDMA_REQ_SAI_2_RX = 54U,
    EDMA_REQ_ENET_MAC0_TIMER_CH_0 = 55U,
    EDMA_REQ_ENET_MAC0_TIMER_CH_1 = 56U,
    EDMA_REQ_ENET_MAC0_TIMER_CH_2 = 57U,
    EDMA_REQ_ENET_SWITCH_XLEARN_AVAIL = 59U,
    EDMA_REQ_FCCU = 61U,
    EDMA_REQ_MUX0_ALWAYS_ENABLED_0 = 62U,
    EDMA_REQ_MUX0_ALWAYS_ENABLED_1 = 63U,
    EDMA_REQ_DISABLED_MUX1 = 64U,
    EDMA_REQ_ADC_0_MUX1 = 65U,
    EDMA_REQ_ADC_1_MUX1 = 66U,
    EDMA_REQ_CMP_1 = 67U,
    EDMA_REQ_BCTU_1 = 68U,
    EDMA_REQ_FlexCAN_1 = 69U,
    EDMA_REQ_FlexCAN_3 = 71U,
    EDMA_REQ_FlexCAN_5 = 73U,
    EDMA_REQ_SPI_1_TX = 76U,
    EDMA_REQ_SPI_1_RX = 77U,
    EDMA_REQ_SPI_1_CMD = 78U,
    EDMA_REQ_SPI_3_TX = 79U,
    EDMA_REQ_SPI_3_RX = 80U,
    EDMA_REQ_SPI_3_CMD = 81U,
    EDMA_REQ_SPI_5_TX = 82U,
    EDMA_REQ_SPI_5_RX = 83U,
    EDMA_REQ_SPI_5_CMD = 84U,
    EDMA_REQ_DSPI_1_TX = 85U,
    EDMA_REQ_DSPI_1_RX = 86U,
    EDMA_REQ_DSPI_1_CMD = 87U,
    EDMA_REQ_DSPI_1_DSI = 88U,
    EDMA_REQ_DSPI_3_TX = 89U,
    EDMA_REQ_DSPI_3_RX = 90U,
    EDMA_REQ_DSPI_3_CMD = 91U,
    EDMA_REQ_DSPI_3_DSI = 92U,
    EDMA_REQ_LIN_1_TX = 93U,
    EDMA_REQ_LIN_1_RX = 94U,
    EDMA_REQ_eMIOS_0_CH_E = 95U,
    EDMA_REQ_eMIOS_0_CH_F = 96U,
    EDMA_REQ_eMIOS_0_CH_G = 97U,
    EDMA_REQ_eMIOS_0_CH_H = 98U,
    EDMA_REQ_eMIOS_1_CH_E = 99U,
    EDMA_REQ_eMIOS_1_CH_F = 100U,
    EDMA_REQ_eMIOS_1_CH_G = 101U,
    EDMA_REQ_eMIOS_1_CH_H = 102U,
    EDMA_REQ_I2C_1_TX = 103U,
    EDMA_REQ_I2C_1_RX = 104U,
    EDMA_REQ_I2C_3_TX = 105U,
    EDMA_REQ_I2C_3_RX = 106U,
    EDMA_REQ_FlexCAN_7 = 107U,
    EDMA_REQ_eMIOS_2_CH_E = 109U,
    EDMA_REQ_eMIOS_2_CH_F = 110U,
    EDMA_REQ_eMIOS_2_CH_G = 111U,
    EDMA_REQ_eMIOS_2_CH_H = 112U,
    EDMA_REQ_SAI_1_TX = 113U,
    EDMA_REQ_SAI_1_RX = 114U,
    EDMA_REQ_ENET_MAC1_TIMER_CH_0 = 115U,
    EDMA_REQ_ENET_MAC1_TIMER_CH_1 = 116U,
    EDMA_REQ_ENET_MAC1_TIMER_CH_2 = 117U,
    EDMA_REQ_MUX1_ALWAYS_ENABLED_0 = 126U,
    EDMA_REQ_MUX1_ALWAYS_ENABLED_1 = 127U
} dma_request_source_t;


/* HSM module features */

/* @brief HSM to HOST interface registers base address. */
#define HSM_BASE                               (0xFFF30000U)

/* @brief Slow IRC trimmed clock frequency(128KHz). */
#define FEATURE_IRCOSC0_FREQ (128000U)

/* @brief Fast IRC trimmed clock frequency(16MHz). */
#define FEATURE_IRCOSC1_FREQ  (16000000U)

