FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
/* @brief Define identifiers of auxiliary clock selectors */
#define NO_AC     0U
#define AC0__SC   1U
#define AC1__SC   2U
#define AC2__SC   3U
#define AC3__SC   4U
#define AC4__SC   5U
#define AC5__SC   6U
#define AC6__SC   7U
#define AC7__SC   8U
#define AC8__SC   9U
#define AC9__SC   10U
#define AC10__SC  11U
#define AC11__SC  12U
#define AC12__SC  13U
#define AC13__SC  14U
#define AC14__SC  15U
#define AC15__SC  16U
#define AC0__DC0  17U
#define AC0__DC1  18U
#define AC0__DC2  19U
#define AC0__DC3  20U
#define AC1__DC0  21U
#define AC1__DC1  22U
#define AC1__DC2  23U
#define AC1__DC3  24U
#define AC2__DC0  25U
#define AC2__DC1  26U
#define AC2__DC2  27U
#define AC2__DC3  28U
#define AC3__DC0  29U
#define AC3__DC1  40U
#define AC3__DC2  41U
#define AC3__DC3  42U
#define AC4__DC0  43U
#define AC4__DC1  44U
#define AC4__DC2  45U
#define AC4__DC3  46U
#define AC5__DC0  47U
#define AC5__DC1  48U
#define AC5__DC2  49U
#define AC5__DC3  50U
#define AC6__DC0  51U
#define AC6__DC1  52U
#define AC6__DC2  53U
#define AC6__DC3  54U
#define AC7__DC0  55U
#define AC7__DC1  56U
#define AC7__DC2  57U
#define AC7__DC3  58U
#define AC8__DC0  59U
#define AC8__DC1  60U
#define AC8__DC2  61U
#define AC8__DC3  62U
#define AC9__DC0  63U
#define AC9__DC1  64U
#define AC9__DC2  65U
#define AC9__DC3  66U
#define AC10__DC0 67U
#define AC10__DC1 68U
#define AC10__DC2 69U
#define AC10__DC3 70U
#define AC11__DC0 71U
#define AC11__DC1 72U
#define AC11__DC2 73U
#define AC11__DC3 74U
#define AC12__DC0 75U
#define AC12__DC1 76U
#define AC12__DC2 77U
#define AC12__DC3 78U
#define AC13__DC0 79U
#define AC13__DC1 80U
#define AC13__DC2 81U
#define AC13__DC3 82U
#define AC14__DC0 83U
#define AC14__DC1 84U
#define AC14__DC2 85U
#define AC14__DC3 86U
#define AC15__DC0 87U
#define AC15__DC1 88U
#define AC15__DC2 89U
#define AC15__DC3 90U

/* @brief PLL input reference. */
#define FEATURE_PLL0_INPUT_REFERENCE  AC5__SC
#define FEATURE_PLL1_INPUT_REFERENCE  NO_AC

/* @brief PLL reduced frequency divider version. */
#define FEATURE_PLL_REDUCED_FREQ_DIV_VERSION (1U)

/* @brief FLEXCAN0 configurable interface clock. */
#define FEATURE_FLEXCAN0_CLK_CONFIGURABLE_INTERFACE_CLOCK (1U)


#define FEATURE_HAS_SIRC_CLK             (1U)
#define FEATURE_HAS_FIRC_CLK             (1U)
#define FEATURE_HAS_IRCOSC_CLK           (0U)
#define FEATURE_HAS_SXOSC_CLK            (1U)
#define FEATURE_HAS_FXOSC_CLK            (1U)
#define FEATURE_HAS_XOSC_CLK             (0U)
#define FEATURE_HAS_PLL_PHI0_CLK         (1U)
#define FEATURE_HAS_PLL_PHI1_CLK         (1U)
#define FEATURE_HAS_PLL0_PHI0_CLK        (0U)
#define FEATURE_HAS_PLL0_PHI1_CLK        (0U)
#define FEATURE_HAS_PLL1_PHI0_CLK        (0U)
#define FEATURE_HAS_PLL1_PHI1_CLK        (0U)
#define FEATURE_HAS_SYS_CLKS             (1U)
#define FEATURE_HAS_S160_CLKS            (1U)
#define FEATURE_HAS_S80_CLKS             (1U)
#define FEATURE_HAS_S40_CLKS             (1U)
#define FEATURE_HAS_F40_CLKS             (1U)
#define FEATURE_HAS_F80_CLKS             (1U)
#define FEATURE_HAS_FS80_CLKS            (1U)
#define FEATURE_HAS_F20_CLKS             (1U)
#define FEATURE_HAS_PBRIDGEx_CLKS        (0U)
#define FEATURE_HAS_HALFSYS_CLKS         (0U)
#define FEATURE_HAS_MOTC_CLKS            (0U)
#define FEATURE_HAS_ADC_CLKS             (0U)
#define FEATURE_HAS_ENET_CLKS            (1U)
#define FEATURE_HAS_ENET_TIME_CLKS       (0U)
#define FEATURE_HAS_FLEXCAN_CLKS         (0U)
#define FEATURE_HAS_FLEXRAY_CLKS         (0U)
#define FEATURE_HAS_LFAST_CLKS           (0U)
#define FEATURE_HAS_SDHC_CLKS            (1U)
#define FEATURE_HAS_SENT_CLKS            (0U)
#define FEATURE_HAS_SGEN_CLKS            (0U)
#define FEATURE_HAS_SPI_CLKS             (1U)


#define FEATURE_PROTOCOL_CLOCK_FOR_ADC             NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_ENET            AC2__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_ENET_TIME       NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_FLEXCAN         NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_FLEXRAY         NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_LFAST           NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_SDHC            AC4__SC
#define FEATURE_PROTOCOL_CLOCK_FOR_SENT            NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_SGEN            NO_AC
#define FEATURE_PROTOCOL_CLOCK_FOR_SPI             AC8__SC
#define FEATURE_INTERFACE_CLOCK_FOR_ADC            NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ENET           NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_ENET_TIME      NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_FLEXCAN        AC9__SC
#define FEATURE_INTERFACE_CLOCK_FOR_FLEXRAY        NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_LFAST          NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SDHC           NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SENT           NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SGEN           NO_AC
#define FEATURE_INTERFACE_CLOCK_FOR_SPI            NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ADC         NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ENET        NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_ENET_TIME   NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_FLEXCAN     NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_FLEXRAY     NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_LFAST       NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SDHC        NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SENT        NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SGEN        NO_AC
#define FEATURE_FRACTIONAL_DIVIDER_FOR_SPI         NO_AC


/*! @brief Clock names. */
typedef enum {
    /* Clock sources */
    SIRC_CLK                       = 0u,      /*!< SIRC_CLK clock source                  */
    FIRC_CLK                       = 1u,      /*!< FIRC_CLK clock source                  */
    SXOSC_CLK                      = 2u,      /*!< SXOSC_CLK clock source                 */
    FXOSC_CLK                      = 3u,      /*!< FXOSC_CLK clock source                 */
    PLL_PHI0_CLK                   = 4u,      /*!< PLL_PHI0_CLK clock source              */
    PLL_PHI1_CLK                   = 5u,      /*!< PLL_PHI1_CLK clock source              */
    SIRC_UNDIVIDED_CLK             = 6u,      /*!< SIRC_UNDIVIDED_CLK clock source        */
    FIRC_UNDIVIDED_CLK             = 7u,      /*!< FIRC_UNDIVIDED_CLK clock source        */
    SXOSC_UNDIVIDED_CLK            = 8u,      /*!< SXOSC_UNDIVIDED_CLK clock source       */
    FXOSC_UNDIVIDED_CLK            = 9u,      /*!< FXOSC_UNDIVIDED_CLK clock source       */
    END_OF_CLK_SOURCES             = 20u,      /*!< End of clock sources                  */
    /* System and common clocks */
    SYS_CLK                        = 21u,      /*!< SYS_CLK common clock                  */
    S160_CLK                       = 22u,      /*!< S160_CLK common clock                 */
    S80_CLK                        = 23u,      /*!< S80_CLK common clock                  */
    S40_CLK                        = 24u,      /*!< S40_CLK common clock                  */
    F40_CLK                        = 25u,      /*!< F40_CLK common clock                  */
    F80_CLK                        = 26u,      /*!< F80_CLK common clock                  */
    FS80_CLK                       = 27u,      /*!< FS80_CLK common clock                 */
    F20_CLK                        = 28u,      /*!< F20_CLK common clock                  */
    CORE_CLK                       = 29u,      /*!< CORE_CLK                              */
    END_OF_SYSTEM_CLKS             = 40u,      /*!< End of common and system clocks       */
    END_OF_SYS_CLKS                = 41u,      /*!< End of SYS_CLK clocks                 */
    END_OF_S160_CLKS               = 42u,      /*!< End of S160_CLK clocks                */
    END_OF_S80_CLKS                = 43u,      /*!< End of S80_CLK clocks                 */
    CMP0_CLK                       = 44u,      /*!< CMP0_CLK clock source                 */
    CMP1_CLK                       = 45u,      /*!< CMP1_CLK clock source                 */
    CMP2_CLK                       = 46u,      /*!< CMP2_CLK clock source                 */
    CRC0_CLK                       = 47u,      /*!< CRC0_CLK clock source                 */
    SAI0_CLK                       = 48u,      /*!< SAI0_CLK clock source                 */
    SAI1_CLK                       = 49u,      /*!< SAI1_CLK clock source                 */
    SAI2_CLK                       = 50u,      /*!< SAI2_CLK clock source                 */
    WKPU0_CLK                      = 51u,      /*!< WKPU0_CLK clock source                */
    END_OF_S40_CLKS                = 52u,      /*!< End of S40_CLK clocks                 */
    DSPI0_CLK                      = 53u,      /*!< DSPI0_CLK clock source                */
    DSPI1_CLK                      = 54u,      /*!< DSPI1_CLK clock source                */
    IIC0_CLK                       = 55u,      /*!< IIC0_CLK clock source                 */
    IIC1_CLK                       = 56u,      /*!< IIC1_CLK clock source                 */
    IIC2_CLK                       = 57u,      /*!< IIC2_CLK clock source                 */
    IIC3_CLK                       = 58u,      /*!< IIC3_CLK clock source                 */
    LIN0_CLK                       = 59u,      /*!< LIN0_CLK clock source                 */
    PITRTI0_CLK                    = 60u,      /*!< PITRTI0_CLK clock source              */
    SPI3_CLK                       = 61u,      /*!< SPI3_CLK clock source                 */
    SPI4_CLK                       = 62u,      /*!< SPI4_CLK clock source                 */
    SPI5_CLK                       = 63u,      /*!< SPI5_CLK clock source                 */
    END_OF_F40_CLKS                = 64u,      /*!< End of F40_CLK clocks                 */
    DSPI2_CLK                      = 65u,      /*!< DSPI2_CLK clock source                */
    DSPI3_CLK                      = 66u,      /*!< DSPI3_CLK clock source                */
    LIN1_CLK                       = 67u,      /*!< LIN1_CLK clock source                 */
    LIN2_CLK                       = 68u,      /*!< LIN2_CLK clock source                 */
    LIN3_CLK                       = 69u,      /*!< LIN3_CLK clock source                 */
    LIN4_CLK                       = 70u,      /*!< LIN4_CLK clock source                 */
    LIN5_CLK                       = 71u,      /*!< LIN5_CLK clock source                 */
    LIN6_CLK                       = 72u,      /*!< LIN6_CLK clock source                 */
    LIN7_CLK                       = 73u,      /*!< LIN7_CLK clock source                 */
    LIN8_CLK                       = 74u,      /*!< LIN8_CLK clock source                 */
    LIN9_CLK                       = 75u,      /*!< LIN9_CLK clock source                 */
    LIN10_CLK                      = 76u,      /*!< LIN10_CLK clock source                */
    LIN11_CLK                      = 77u,      /*!< LIN11_CLK clock source                */
    LIN12_CLK                      = 78u,      /*!< LIN12_CLK clock source                */
    LIN13_CLK                      = 79u,      /*!< LIN13_CLK clock source                */
    LIN14_CLK                      = 80u,      /*!< LIN14_CLK clock source                */
    LIN15_CLK                      = 81u,      /*!< LIN15_CLK clock source                */
    LIN16_CLK                      = 82u,      /*!< LIN16_CLK clock source                */
    LIN17_CLK                      = 83u,      /*!< LIN17_CLK clock source                */
    MLB0_CLK                       = 84u,      /*!< MLB0_CLK clock source                 */
    SPI1_CLK                       = 85u,      /*!< SPI1_CLK clock source                 */
    SPI2_CLK                       = 86u,      /*!< SPI2_CLK clock source                 */
    USBOTG0_CLK                    = 87u,      /*!< USBOTG0_CLK clock source              */
    USBSPH0_CLK                    = 88u,      /*!< USBSPH0_CLK clock source              */
    END_OF_F80_CLKS                = 89u,      /*!< End of F80_CLK clocks                 */
    ADC0_CLK                       = 90u,      /*!< ADC0_CLK clock source                 */
    ADC1_CLK                       = 91u,      /*!< ADC1_CLK clock source                 */
    BCTU0_CLK                      = 92u,      /*!< BCTU0_CLK clock source                */
    DMA0_CLK                       = 93u,      /*!< DMA0_CLK clock source                 */
    DMAMUX0_CLK                    = 94u,      /*!< DMAMUX0_CLK clock source              */
    DMAMUX1_CLK                    = 95u,      /*!< DMAMUX1_CLK clock source              */
    FLEXRAY0_CLK                   = 96u,      /*!< FLEXRAY0_CLK clock source             */
    eMIOS0_CLK                     = 97u,      /*!< eMIOS0_CLK clock source               */
    eMIOS1_CLK                     = 98u,      /*!< eMIOS1_CLK clock source               */
    eMIOS2_CLK                     = 99u,      /*!< eMIOS2_CLK clock source               */
    END_OF_FS80_CLKS               = 100u,      /*!< End of FS80_CLK clocks                */
    END_OF_F20_CLKS                = 101u,      /*!< End of F20_CLK clocks                 */
    ENET0_CLK                      = 102u,      /*!< ENET0_CLK clock source                */
    ENET0_TIME_CLK                 = 103u,      /*!< ENET0_TIME_CLK clock source           */
    ENET1_CLK                      = 104u,      /*!< ENET1_CLK clock source                */
    END_OF_ENET_CLKS               = 105u,      /*!< End of ENET_CLK clocks                */
    SDHC0_CLK                      = 106u,      /*!< SDHC0_CLK clock source                */
    END_OF_SDHC_CLKS               = 107u,      /*!< End of SDHC_CLK clocks                */
    SPI0_CLK                       = 108u,      /*!< SPI0_CLK clock source                 */
    END_OF_SPI_CLKS                = 109u,      /*!< End of SPI_CLK clocks                 */
    FLEXCAN0_CLK                   = 110u,      /*!< FLEXCAN0_CLK clock source             */
    FLEXCAN1_CLK                   = 111u,      /*!< FLEXCAN1_CLK clock source             */
    FLEXCAN2_CLK                   = 112u,      /*!< FLEXCAN2_CLK clock source             */
    FLEXCAN3_CLK                   = 113u,      /*!< FLEXCAN3_CLK clock source             */
    FLEXCAN4_CLK                   = 114u,      /*!< FLEXCAN4_CLK clock source             */
    FLEXCAN5_CLK                   = 115u,      /*!< FLEXCAN5_CLK clock source             */
    FLEXCAN6_CLK                   = 116u,      /*!< FLEXCAN6_CLK clock source             */
    FLEXCAN7_CLK                   = 117u,      /*!< FLEXCAN7_CLK clock source             */
    MEMU0_CLK                      = 118u,      /*!< MEMU0_CLK clock source                */
    MEMU1_CLK                      = 119u,      /*!< MEMU1_CLK clock source                */
    RTC0_CLK                       = 120u,      /*!< RTC0_CLK clock source                 */
    SIUL0_CLK                      = 121u,      /*!< SIUL0_CLK clock source                */
    END_OF_PERIPHERAL_CLKS         = 122u,      /*!< End of peripheral clocks              */
    CLOCK_NAME_COUNT,
} clock_names_t;

#define MC_ME_INVALID_INDEX  MC_ME_PCTLn_COUNT

