FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
  /*! @brief MC_ME clock name mappings
   *  Mappings between clock names and peripheral clock control indexes.
   *  If there is no peripheral clock control index for a clock name,
   *  then the corresponding value is MC_ME_INVALID_INDEX.
   */
#define MC_ME_CLOCK_NAME_MAPPINGS \
{                                                                              \
MC_ME_INVALID_INDEX,                /*!< SIRC_CLK clock                                     0  */ \
MC_ME_INVALID_INDEX,                /*!< FIRC_CLK clock                                     1  */ \
MC_ME_INVALID_INDEX,                /*!< SXOSC_CLK clock                                    2  */ \
MC_ME_INVALID_INDEX,                /*!< FXOSC_CLK clock                                    3  */ \
MC_ME_INVALID_INDEX,                /*!< PLL_PHI0_CLK clock                                 4  */ \
MC_ME_INVALID_INDEX,                /*!< PLL_PHI1_CLK clock                                 5  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    6  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    7  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    8  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    9  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    10  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    11  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    12  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    13  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    14  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    15  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    16  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    17  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    18  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    19  */ \
MC_ME_INVALID_INDEX,                /*!< END_OF_CLK_SOURCES                                 20  */  \
MC_ME_INVALID_INDEX,                /*!< SYS_CLK clock                                      21  */ \
MC_ME_INVALID_INDEX,                /*!< S160_CLK clock                                     22  */ \
MC_ME_INVALID_INDEX,                /*!< S80_CLK clock                                      23  */ \
MC_ME_INVALID_INDEX,                /*!< S40_CLK clock                                      24  */ \
MC_ME_INVALID_INDEX,                /*!< F40_CLK clock                                      25  */ \
MC_ME_INVALID_INDEX,                /*!< F80_CLK clock                                      26  */ \
MC_ME_INVALID_INDEX,                /*!< FS80_CLK clock                                     27  */ \
MC_ME_INVALID_INDEX,                /*!< F20_CLK clock                                      28  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    29  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    30  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    31  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    32  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    33  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    34  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    35  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    36  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    37  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    38  */ \
MC_ME_INVALID_INDEX,                /*!< No clock entry in clock_names_t                    39  */ \
MC_ME_INVALID_INDEX,                /*!< END_OF_SYSTEM_CLOCKS                               40  */  \
MC_ME_INVALID_INDEX,                /*!< End of SYS clocks                                  41 */ \
MC_ME_INVALID_INDEX,                /*!< End of S160 clocks                                 42 */ \
MC_ME_INVALID_INDEX,                /*!< End of S80 clocks                                  43 */ \
MC_ME_PCTL_CMP_0_INDEX,             /*!< CMP0 clock source                                  44 */ \
MC_ME_PCTL_CMP_1_INDEX,             /*!< CMP1 clock source                                  45 */ \
MC_ME_PCTL_CMP_2_INDEX,             /*!< CMP2 clock source                                  46 */ \
MC_ME_PCTL_CRC_INDEX,               /*!< CRC0 clock source                                  47 */ \
MC_ME_PCTL_SAI0_INDEX,              /*!< SAI0 clock source                                  48 */ \
MC_ME_PCTL_SAI1_INDEX,              /*!< SAI1 clock source                                  49 */ \
MC_ME_PCTL_SAI2_INDEX,              /*!< SAI2 clock source                                  50 */ \
MC_ME_PCTL_WKPU_INDEX,              /*!< WKPU0 clock source                                 51 */ \
MC_ME_INVALID_INDEX,                /*!< End of S40 clocks                                  52 */ \
MC_ME_PCTL_DSPI_0_INDEX,            /*!< DSPI0 clock source                                 53 */ \
MC_ME_PCTL_DSPI_1_INDEX,            /*!< DSPI1 clock source                                 54 */ \
MC_ME_PCTL_IIC_0_INDEX,             /*!< IIC0 clock source                                  55 */ \
MC_ME_PCTL_IIC_1_INDEX,             /*!< IIC1 clock source                                  56 */ \
MC_ME_PCTL_IIC_2_INDEX,             /*!< IIC2 clock source                                  57 */ \
MC_ME_PCTL_IIC_3_INDEX,             /*!< IIC3 clock source                                  58 */ \
MC_ME_PCTL_LIN_0_INDEX,             /*!< LIN0 clock source                                  59 */ \
MC_ME_PCTL_PIT_RTI_0_INDEX,         /*!< PITRTI0 clock source                               60 */ \
MC_ME_PCTL_SPI3_INDEX,              /*!< SPI3 clock source                                  61 */ \
MC_ME_PCTL_SPI4_INDEX,              /*!< SPI4 clock source                                  62 */ \
MC_ME_PCTL_SPI5_INDEX,              /*!< SPI5 clock source                                  63 */ \
MC_ME_INVALID_INDEX,                /*!< End of F40 clocks                                  64 */ \
MC_ME_PCTL_DSPI_2_INDEX,            /*!< DSPI2 clock source                                 65 */ \
MC_ME_PCTL_DSPI_3_INDEX,            /*!< DSPI3 clock source                                 66 */ \
MC_ME_PCTL_LIN_1_INDEX,             /*!< LIN1 clock source                                  67 */ \
MC_ME_PCTL_LIN_2_INDEX,             /*!< LIN2 clock source                                  68 */ \
MC_ME_PCTL_LIN_3_INDEX,             /*!< LIN3 clock source                                  69 */ \
MC_ME_PCTL_LIN_4_INDEX,             /*!< LIN4 clock source                                  70 */ \
MC_ME_PCTL_LIN_5_INDEX,             /*!< LIN5 clock source                                  71 */ \
MC_ME_PCTL_LIN_6_INDEX,             /*!< LIN6 clock source                                  72 */ \
MC_ME_PCTL_LIN_7_INDEX,             /*!< LIN7 clock source                                  73 */ \
MC_ME_PCTL_LIN_8_INDEX,             /*!< LIN8 clock source                                  74 */ \
MC_ME_PCTL_LIN_9_INDEX,             /*!< LIN9 clock source                                  75 */ \
MC_ME_PCTL_LIN_10_INDEX,            /*!< LIN10 clock source                                 76 */ \
MC_ME_PCTL_LIN_11_INDEX,            /*!< LIN11 clock source                                 77 */ \
MC_ME_PCTL_LIN_12_INDEX,            /*!< LIN12 clock source                                 78 */ \
MC_ME_PCTL_LIN_13_INDEX,            /*!< LIN13 clock source                                 79 */ \
MC_ME_PCTL_LIN_14_INDEX,            /*!< LIN14 clock source                                 80 */ \
MC_ME_PCTL_LIN_15_INDEX,            /*!< LIN15 clock source                                 81 */ \
MC_ME_PCTL_LIN_16_INDEX,            /*!< LIN16 clock source                                 82 */ \
MC_ME_PCTL_LIN_17_INDEX,            /*!< LIN17 clock source                                 83 */ \
MC_ME_PCTL_MLB_INDEX,               /*!< MLB0 clock source                                  84 */ \
MC_ME_PCTL_SPI1_INDEX,              /*!< SPI1 clock source                                  85 */ \
MC_ME_PCTL_SPI2_INDEX,              /*!< SPI2 clock source                                  86 */ \
MC_ME_PCTL_USB_OTG_INDEX,           /*!< USBOTG0 clock source                               87 */ \
MC_ME_PCTL_USB_SPH_INDEX,           /*!< USBSPH0 clock source                               88 */ \
MC_ME_INVALID_INDEX,                /*!< End of F80 clocks                                  89 */ \
MC_ME_PCTL_ADC_0_INDEX,             /*!< ADC0 clock source                                  90 */ \
MC_ME_PCTL_ADC_1_INDEX,             /*!< ADC1 clock source                                  91 */ \
MC_ME_PCTL_BCTU_INDEX,              /*!< BCTU0 clock source                                 92 */ \
MC_ME_INVALID_INDEX,                /*!< DMA0 clock source                                  93 */ \
MC_ME_PCTL_DMAUX_INDEX,             /*!< DMAMUX0 clock source                               94 */ \
MC_ME_PCTL_DMAUX_INDEX,             /*!< DMAMUX1 clock source                               95 */ \
MC_ME_PCTL_FlexRay_INDEX,           /*!< FLEXRAY0 clock source                              96 */ \
MC_ME_PCTL_eMIOS_0_INDEX,           /*!< eMIOS0 clock source                                97 */ \
MC_ME_PCTL_eMIOS_1_INDEX,           /*!< eMIOS1 clock source                                98 */ \
MC_ME_PCTL_eMIOS_2_INDEX,           /*!< eMIOS2 clock source                                99 */ \
MC_ME_INVALID_INDEX,                /*!< End of FS80 clocks                                 100 */ \
MC_ME_INVALID_INDEX,                /*!< End of F20 clocks                                  101 */ \
MC_ME_PCTL_ENET_INDEX,              /*!< ENET0 clock source                                 102 */ \
MC_ME_INVALID_INDEX,                /*!< ENET0_TIME clock source                            103 */ \
MC_ME_PCTL_ENET_INDEX,              /*!< ENET1 clock source                                 104 */ \
MC_ME_INVALID_INDEX,                /*!< End of ENET clocks                                 105 */ \
MC_ME_PCTL_SDHC_INDEX,              /*!< SDHC0 clock source                                 106 */ \
MC_ME_INVALID_INDEX,                /*!< End of SDHC clocks                                 107 */ \
MC_ME_PCTL_SPI0_INDEX,              /*!< SPI0 clock source                                  108 */ \
MC_ME_INVALID_INDEX,                /*!< End of SPI clocks                                  109 */ \
MC_ME_PCTL_FLEXCAN_0_INDEX,         /*!< FLEXCAN0 clock source                              110 */ \
MC_ME_PCTL_FLEXCAN_1_INDEX,         /*!< FLEXCAN1 clock source                              111 */ \
MC_ME_PCTL_FLEXCAN_2_INDEX,         /*!< FLEXCAN2 clock source                              112 */ \
MC_ME_PCTL_FLEXCAN_3_INDEX,         /*!< FLEXCAN3 clock source                              113 */ \
MC_ME_PCTL_FLEXCAN_4_INDEX,         /*!< FLEXCAN4 clock source                              114 */ \
MC_ME_PCTL_FLEXCAN_5_INDEX,         /*!< FLEXCAN5 clock source                              115 */ \
MC_ME_PCTL_FLEXCAN_6_INDEX,         /*!< FLEXCAN6 clock source                              116 */ \
MC_ME_PCTL_FLEXCAN_7_INDEX,         /*!< FLEXCAN7 clock source                              117 */ \
MC_ME_PCTL_MEMU_0_INDEX,            /*!< MEMU0 clock source                                 118 */ \
MC_ME_PCTL_MEMU_1_INDEX,            /*!< MEMU1 clock source                                 119 */ \
MC_ME_PCTL_RTC_API_INDEX,           /*!< RTC0 clock source                                  120 */ \
MC_ME_INVALID_INDEX,                /*!< SIUL0 clock source                                 121 */ \
MC_ME_INVALID_INDEX                /*!< END_OF_PERIPHERAL_CLK_SOURCES                       122 */ \
}


  /*! @brief interface clocks
   *  Mappings between clock names and interface clocks.
   *  If no interface clock exists for a given clock name,
   *  then the corresponding value is CLOCK_NAME_COUNT.
   */
#define INTERFACE_CLOCKS \
{                                                                           \
CLOCK_NAME_COUNT,                /*!< SIRC_CLK clock                  0  */ \
CLOCK_NAME_COUNT,                /*!< FIRC_CLK clock                  1  */ \
CLOCK_NAME_COUNT,                /*!< SXOSC_CLK clock                 2  */ \
CLOCK_NAME_COUNT,                /*!< FXOSC_CLK clock                 3  */ \
CLOCK_NAME_COUNT,                /*!< PLL_PHI0_CLK clock              4  */ \
CLOCK_NAME_COUNT,                /*!< PLL_PHI1_CLK clock              5  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 6  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 7  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 8  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 9  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 10  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 11  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 12  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 13  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 14  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 15  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 16  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 17  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 18  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 19  */ \
CLOCK_NAME_COUNT,                /*!< END_OF_CLK_SOURCES              20  */ \
CLOCK_NAME_COUNT,                /*!< SYS_CLK clock                   21  */ \
CLOCK_NAME_COUNT,                /*!< S160_CLK clock                  22  */ \
CLOCK_NAME_COUNT,                /*!< S80_CLK clock                   23  */ \
CLOCK_NAME_COUNT,                /*!< S40_CLK clock                   24  */ \
CLOCK_NAME_COUNT,                /*!< F40_CLK clock                   25  */ \
CLOCK_NAME_COUNT,                /*!< F80_CLK clock                   26  */ \
CLOCK_NAME_COUNT,                /*!< FS80_CLK clock                  27  */ \
CLOCK_NAME_COUNT,                /*!< F20_CLK clock                   28  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 29  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 30  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 31  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 32  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 33  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 34  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 35  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 36  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 37  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 38  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 39  */ \
CLOCK_NAME_COUNT,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
CLOCK_NAME_COUNT,                /*!< End of SYS clocks               41 */ \
CLOCK_NAME_COUNT,                /*!< End of S160 clocks              42 */ \
CLOCK_NAME_COUNT,                /*!< End of S80 clocks               43 */ \
S40_CLK,                         /*!< CMP0 clock                      44 */ \
S40_CLK,                         /*!< CMP1 clock                      45 */ \
S40_CLK,                         /*!< CMP2 clock                      46 */ \
S40_CLK,                         /*!< CRC0 clock                      47 */ \
S40_CLK,                         /*!< SAI0 clock                      48 */ \
S40_CLK,                         /*!< SAI1 clock                      49 */ \
S40_CLK,                         /*!< SAI2 clock                      50 */ \
S40_CLK,                         /*!< WKPU0 clock                     51 */ \
CLOCK_NAME_COUNT,                /*!< End of S40 clocks               52 */ \
S40_CLK,                         /*!< DSPI0 clock                     53 */ \
S40_CLK,                         /*!< DSPI1 clock                     54 */ \
F40_CLK,                         /*!< IIC0 clock                      55 */ \
F40_CLK,                         /*!< IIC1 clock                      56 */ \
F40_CLK,                         /*!< IIC2 clock                      57 */ \
F40_CLK,                         /*!< IIC3 clock                      58 */ \
F20_CLK,                         /*!< LIN0 clock                      59 */ \
F40_CLK,                         /*!< PITRTI0 clock                   60 */ \
S40_CLK,                         /*!< SPI3 clock                      61 */ \
S40_CLK,                         /*!< SPI4 clock                      62 */ \
S40_CLK,                         /*!< SPI5 clock                      63 */ \
CLOCK_NAME_COUNT,                /*!< End of F40 clocks               64 */ \
S40_CLK,                         /*!< DSPI2 clock                     65 */ \
S40_CLK,                         /*!< DSPI3 clock                     66 */ \
F40_CLK,                         /*!< LIN1 clock                      67 */ \
F40_CLK,                         /*!< LIN2 clock                      68 */ \
F40_CLK,                         /*!< LIN3 clock                      69 */ \
F40_CLK,                         /*!< LIN4 clock                      70 */ \
F40_CLK,                         /*!< LIN5 clock                      71 */ \
F40_CLK,                         /*!< LIN6 clock                      72 */ \
F40_CLK,                         /*!< LIN7 clock                      73 */ \
F40_CLK,                         /*!< LIN8 clock                      74 */ \
F40_CLK,                         /*!< LIN9 clock                      75 */ \
F40_CLK,                         /*!< LIN10 clock                     76 */ \
F40_CLK,                         /*!< LIN11 clock                     77 */ \
F40_CLK,                         /*!< LIN12 clock                     78 */ \
F40_CLK,                         /*!< LIN13 clock                     79 */ \
F40_CLK,                         /*!< LIN14 clock                     80 */ \
F40_CLK,                         /*!< LIN15 clock                     81 */ \
F40_CLK,                         /*!< LIN16 clock                     82 */ \
F40_CLK,                         /*!< LIN17 clock                     83 */ \
F40_CLK,                         /*!< MLB0 clock                      84 */ \
S40_CLK,                         /*!< SPI1 clock                      85 */ \
S40_CLK,                         /*!< SPI2 clock                      86 */ \
F80_CLK,                         /*!< USBOTG0 clock                   87 */ \
F80_CLK,                         /*!< USBSPH0 clock                   88 */ \
CLOCK_NAME_COUNT,                /*!< End of F80 clocks               89 */ \
FS80_CLK,                        /*!< ADC0 clock                      90 */ \
FS80_CLK,                        /*!< ADC1 clock                      91 */ \
FS80_CLK,                        /*!< BCTU0 clock                     92 */ \
FS80_CLK,                        /*!< DMA0 clock                      93 */ \
FS80_CLK,                        /*!< DMAMUX0 clock                   94 */ \
FS80_CLK,                        /*!< DMAMUX1 clock                   95 */ \
FS80_CLK,                        /*!< FLEXRAY0 clock                  96 */ \
FS80_CLK,                        /*!< eMIOS0 clock                    97 */ \
FS80_CLK,                        /*!< eMIOS1 clock                    98 */ \
FS80_CLK,                        /*!< eMIOS2 clock                    99 */ \
CLOCK_NAME_COUNT,                /*!< End of FS80 clocks              100 */ \
CLOCK_NAME_COUNT,                /*!< End of F20 clocks               101 */ \
F40_CLK,                         /*!< ENET0 clock                     102 */ \
F40_CLK,                         /*!< ENET0_TIME clock                103 */ \
F40_CLK,                         /*!< ENET1 clock                     104 */ \
CLOCK_NAME_COUNT,                /*!< End of ENET clocks              105 */ \
F40_CLK,                         /*!< SDHC0 clock                     106 */ \
CLOCK_NAME_COUNT,                /*!< End of SDHC clocks              107 */ \
S40_CLK,                         /*!< SPI0 clock                      108 */ \
CLOCK_NAME_COUNT,                /*!< End of SPI clocks               109 */ \
FLEXCAN0_CLK,                    /*!< FLEXCAN0 clock                  110 */ \
FS80_CLK,                        /*!< FLEXCAN1 clock                  111 */ \
FS80_CLK,                        /*!< FLEXCAN2 clock                  112 */ \
FS80_CLK,                        /*!< FLEXCAN3 clock                  113 */ \
FS80_CLK,                        /*!< FLEXCAN4 clock                  114 */ \
FS80_CLK,                        /*!< FLEXCAN5 clock                  115 */ \
FS80_CLK,                        /*!< FLEXCAN6 clock                  116 */ \
FS80_CLK,                        /*!< FLEXCAN7 clock                  117 */ \
F80_CLK,                         /*!< MEMU0 clock                     118 */ \
F80_CLK,                         /*!< MEMU1 clock                     119 */ \
S40_CLK,                         /*!< RTC0 clock                      120 */ \
F40_CLK,                         /*!< SIUL0 clock                     121 */ \
CLOCK_NAME_COUNT                /*!< END_OF_PERIPHERAL_CLK_SOURCES    122 */ \
}


/* Interrupt module features */

