FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
/*! @brief Has adjustable timer enabling IEEE 1588 support */
#define FEATURE_ENET_HAS_ADJUSTABLE_TIMER (1)

/*! @brief Has support for configuring the width of the output compare pulse */
#define FEATURE_ENET_HAS_TIMER_PULSE_WIDTH_CONTROL (1)

/*! @brief The number of available receive and transmit buffer descriptor rings */
#define FEATURE_ENET_RING_COUNT             (3U)

/*! @brief The number of available VLAN priority compare values per class */
#define FEATURE_ENET_CLASS_MATCH_CMP_COUNT  (4U)

/*! @brief Has credit-based shaper */
#define FEATURE_ENET_HAS_CBS                (1)

/*! @brief Has time-based shaper */
#define FEATURE_ENET_HAS_TBS                (1)

/*! @brief Has interrupt coalescing */
#define FEATURE_ENET_HAS_INTCOAL            (1)

/* SIUL2 module feature */
/*! @brief SIUL2 Used for setting Pins */
#define FEATURE_PINS_DRIVER_USING_SIUL2 (1)
/*! @brief SIUL2 module support DDR PAD */
#define FEATURE_SIUL2_HAS_DDR_PAD (0)
/*! @brief SIUL2 module MSCR registers has PKE bit-field */
#define FEATURE_SIUL2_HAS_PULL_KEEPER (0)
/*! @brief SIUL2 module support Analog Pad */
#define FEATURE_SIUL2_HAS_ANALOG_PAD (1)
/*! @brief SIUL2 module MSCR registers has SRC bit-field */
#define FEATURE_SIUL2_HAS_SLEW_RATE_CONTROL (1)
/*! @brief SIUL2 module MSCR registers hysteresis bit-field */
#define FEATURE_SIUL2_HAS_HYSTERESIS (1)
/*! @brief SIUL2 module MSCR register has SMC bit */
#define FEATURE_SIUL2_HAS_SAFE_MODE_CONTROL (1)
/*! @brief SIUL2 module MSCR register has INV bit */
#define FEATURE_SIUL2_HAS_INVERT_DATA_OUTPUT (0)
/*! @brief SIUL2 module IMCR register has INV bit */
#define FEATURE_SIUL2_HAS_INVERT_DATA_INPUT (0)
/*! @brief SIUL2 module PGDO and PGDI bit-fields format as MSB */
#define FEATURE_SIUL2_GPIO_USE_MSB (1)
/*! @brief SIUL2 module PGDO  bit-fields length */
#define FEATURE_SIUL2_PGDOn_REGISTER_LENGTH (16u)
/*! @brief SIUL2 module PGDO  bit-fields length */
#define FEATURE_SIUL2_PGDIn_REGISTER_LENGTH (16u)
/*! @brief SIUL2 module external interrupt support DMA */
#define FEATURE_SIUL2_EXTERNAL_INT_SUPPORT_DMA (0)
/*! @brief SIUL2 module external interrupt pin number */
#define FEATURE_SIUL2_EXTERNAL_INT_PIN_NUMBER (32u)
/*! @brief SIUL2 module output source select bit width */
#define FEATURE_SIUL2_OUTPUT_SOURCE_SELECT_WIDTH       SIUL2_MSCR_SSS_WIDTH
/*! @brief SIUL2 module input source select bit width */
#define FEATURE_SIUL2_INPUT_SOURCE_SELECT_WIDTH        SIUL2_IMCR_SSS_WIDTH
/*! @brief SIUL2 module input mux numbers */
#define FEATURE_SIUL2_INPUT_MUX_WIDTH        (8u)

/* Pins driver feature (common driver for S32K, S32V, C55) */
/* @brief Has open drain control (register bit MSCR[ODE]). */
#define FEATURE_PINS_HAS_OPEN_DRAIN (1)
/* @brief Has pull selection (register bit MSCR[PUS]). */
#define FEATURE_PINS_HAS_PULL_SELECTION (1)
/* @brief Has slew rate control (register bit MSCR[SRE]). */
#define FEATURE_PINS_HAS_SLEW_RATE (0)
/* @brief Has drive strength (register bit MSCR[DSE]). */
#define FEATURE_PINS_HAS_DRIVE_STRENGTH (0)
/* @brief Has drive strength control (register bit MSCR[DSE]). */
#define FEATURE_PINS_HAS_DRIVE_STRENGTH_CONTROL (0)

/* Port module feature */
/* C55 does not have port module,
 * all define related to port module should be 0 to pass MISRA check*/
/* @brief Has control lock */
#define FEATURE_PORT_HAS_PIN_CONTROL_LOCK (0)
/* @brief Has passive filter */
#define FEATURE_PORT_HAS_PASSIVE_FILTER (0)

/** GPIO - Register Layout Typedef */
typedef struct {
  __IO uint16_t PGPDO;          /**< SIUL2 Parallel GPIO Pad Data Out Register, array offset: 0x1700, array step: 0x2 */
       uint16_t RESERVED_PGPDO[SIUL2_PGPDO_COUNT - 1U];
  __I  uint16_t PGPDI;          /**< SIUL2 Parallel GPIO Pad Data In Register, array offset: 0x1740, array step: 0x2 */
       uint16_t RESERVED_PGPDI[SIUL2_PGPDI_COUNT - 1U];
  __O  uint32_t MPGPDO;        /**< SIUL2 Masked Parallel GPIO Pad Data Out Register, array offset: 0x1780, array step: 0x4 */
} GPIO_Type;

 /** Number of instances of the SIUL2 module. */
#define GPIO_INSTANCE_COUNT (17u)

/* SIUL2 - Peripheral instance base addresses */
/** Peripheral SIUL2 base address */
#define GPIO_BASE                               (0xFFFC1700u)
/** Peripheral SIUL2 base pointer */
#define GPIO                                    ((GPIO_Type *)GPIO_BASE)

 /* GPIO - Peripheral instance base addresses */
/** Peripheral PTA base address */
#define PTA_BASE                                 (0xFFFC1700u)
/** Peripheral PTA base pointer */
#define PTA                                      ((GPIO_Type *)PTA_BASE)
/** Peripheral PTB base address */
#define PTB_BASE                                 (0xFFFC1702u)
/** Peripheral PTB base pointer */
#define PTB                                      ((GPIO_Type *)PTB_BASE)
/** Peripheral PTC base address */
#define PTC_BASE                                 (0xFFFC1704u)
/** Peripheral PTC base pointer */
#define PTC                                      ((GPIO_Type *)PTC_BASE)
/** Peripheral PTD base address */
#define PTD_BASE                                 (0xFFFC1706u)
/** Peripheral PTD base pointer */
#define PTD                                      ((GPIO_Type *)PTD_BASE)
/** Peripheral PTE base address */
#define PTE_BASE                                 (0xFFFC1708u)
/** Peripheral PTE base pointer */
#define PTE                                      ((GPIO_Type *)PTE_BASE)
/** Peripheral PTF base address */
#define PTF_BASE                                 (0xFFFC170Au)
/** Peripheral PTF base pointer */
#define PTF                                      ((GPIO_Type *)PTF_BASE)
/** Peripheral PTG base address */
#define PTG_BASE                                 (0xFFFC170Cu)
/** Peripheral PTG base pointer */
#define PTG                                      ((GPIO_Type *)PTG_BASE)
/** Peripheral PTH base address */
#define PTH_BASE                                 (0xFFFC170Eu)
/** Peripheral PTH base pointer */
#define PTH                                      ((GPIO_Type *)PTH_BASE)
/** Peripheral PTI base address */
#define PTI_BASE                                 (0xFFFC1710u)
/** Peripheral PTI base pointer */
#define PTI                                      ((GPIO_Type *)PTI_BASE)
/** Peripheral PTJ base address */
#define PTJ_BASE                                 (0xFFFC1712u)
/** Peripheral PTJ base pointer */
#define PTJ                                      ((GPIO_Type *)PTJ_BASE)
/** Peripheral PTK base address */
#define PTK_BASE                                 (0xFFFC1714u)
/** Peripheral PTK base pointer */
#define PTK                                      ((GPIO_Type *)PTK_BASE)
/** Peripheral PTL base address */
#define PTL_BASE                                 (0xFFFC1716u)
/** Peripheral PTL base pointer */
#define PTL                                      ((GPIO_Type *)PTL_BASE)
/** Peripheral PTM base address */
#define PTM_BASE                                 (0xFFFC1718u)
/** Peripheral PTM base pointer */
#define PTM                                      ((GPIO_Type *)PTM_BASE)
/** Peripheral PTN base address */
#define PTN_BASE                                 (0xFFFC171Au)
/** Peripheral PTN base pointer */
#define PTN                                      ((GPIO_Type *)PTN_BASE)
/** Peripheral PTO base address */
#define PTO_BASE                                 (0xFFFC171Cu)
/** Peripheral PTO base pointer */
#define PTO                                      ((GPIO_Type *)PTO_BASE)
/** Peripheral PTP base address */
#define PTP_BASE                                 (0xFFFC171Eu)
/** Peripheral PTP base pointer */
#define PTP                                      ((GPIO_Type *)PTP_BASE)
/** Peripheral PTQ base address */
#define PTQ_BASE                                 (0xFFFC1720u)
/** Peripheral PTQ base pointer */
#define PTQ                                      ((GPIO_Type *)PTQ_BASE)
/** Array initializer of GPIO peripheral base addresses */
#define GPIO_BASE_ADDRS                          { PTA_BASE, PTB_BASE, PTC_BASE, PTD_BASE, \
                                                   PTE_BASE, PTF_BASE, PTG_BASE, PTH_BASE, \
                                                   PTI_BASE, PTJ_BASE, PTK_BASE, PTL_BASE, \
                                                   PTM_BASE, PTL_BASE, PTO_BASE, PTP_BASE, \
                                                   PTQ_BASE}
/** Array initializer of GPIO peripheral base pointers */
#define GPIO_BASE_PTRS                           { PTA, PTB, PTC, PTD, PTE, PTF, PTG, PTH, \
                                                   PTI, PTJ, PTK, PTL, PTM, PTN, PTO, PTP, \
                                                   PTQ }

