FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
/** PORT - Register Layout Typedef */
typedef struct {
  __IO  uint32_t MSCR[16];
        uint32_t RESERVED_MSCR[SIUL2_MSCR_COUNT - 16U];
        uint8_t RESERVED_9[992];
  __IO uint32_t IMCR[16];
} PORT_Type;

#define SIUL2_MSCR_BASE                          (SIUL2->MSCR)
#define SIUL2_IMCR_BASE                          (SIUL2->IMCR)
#define PORTA                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x00))
#define PORTB                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x10))
#define PORTC                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x20))
#define PORTD                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x30))
#define PORTE                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x40))
#define PORTF                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x50))
#define PORTG                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x60))
#define PORTH                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x70))
#define PORTI                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x80))
#define PORTJ                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x90))
#define PORTK                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xA0))
#define PORTL                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xB0))
#define PORTM                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xC0))
#define PORTN                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xD0))
#define PORTO                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xE0))
#define PORTP                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xF0))
#define PORTQ                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x100))
#define PORT_BASE_PTRS                           { PORTA, PORTB, PORTC, PORTD, PORTE, PORTF, \
                                                   PORTG, PORTH, PORTI, PORTJ, PORTK, PORTL, \
                                                   PORTM, PORTN, PORTO, PORTP, PORTQ }

/*                  PA3, PA6, PA7,  PA8, PA14, PC2, PC3, PC5, PC14,  PE4, PE10, PE12, PE14, PF15, PG1, PG8,*/
#define PORT_IRQS   {3,    6,   7,    8,   14,  34,  35,  37,   46,   68,   74,   76,   78,   95,  97, 104, \
                    11,   12,  36,   44,   47,  66,  70,  71,  203,  238,  236,  234,  232,  230, 227, 163}
/*                PA11, PA12, PC4, PC12, PC15, PE2, PE6, PE7, PM11, PO14, PO12, PO10,  PO8,  PO6, PO3, PK3 */

/* DSPI module feature */

/* Define the PCS allocation for each DSPI/SPI module */
#define FEATURE_DSPI_0_PCS_NUMBER 6
#define FEATURE_DSPI_1_PCS_NUMBER 5
#define FEATURE_DSPI_2_PCS_NUMBER 4
#define FEATURE_DSPI_3_PCS_NUMBER 2
#define FEATURE_SPI_0_PCS_NUMBER 4
#define FEATURE_SPI_1_PCS_NUMBER 4
#define FEATURE_SPI_2_PCS_NUMBER 4
#define FEATURE_SPI_3_PCS_NUMBER 4
#define FEATURE_SPI_4_PCS_NUMBER 1
#define FEATURE_SPI_5_PCS_NUMBER 1
#define FEATURE_DSPI_PCS_MAPPING {FEATURE_DSPI_0_PCS_NUMBER, FEATURE_DSPI_1_PCS_NUMBER, \
                                  FEATURE_DSPI_2_PCS_NUMBER, FEATURE_DSPI_3_PCS_NUMBER, \
                                  FEATURE_SPI_0_PCS_NUMBER, FEATURE_SPI_1_PCS_NUMBER, \
                                  FEATURE_SPI_2_PCS_NUMBER, FEATURE_SPI_3_PCS_NUMBER, \
                                  FEATURE_SPI_4_PCS_NUMBER, FEATURE_SPI_5_PCS_NUMBER}

/* Define the instance realocation */
#define FEATURE_DSPI_INSTANCES  {DSPI_0, DSPI_1, DSPI_2, DSPI_3, (DSPI_Type *)SPI_0_BASE, \
                                 (DSPI_Type *)SPI_1_BASE, (DSPI_Type *)SPI_2_BASE, \
                                 (DSPI_Type *)SPI_3_BASE, (DSPI_Type *)SPI_4_BASE, \
                                 (DSPI_Type *)SPI_5_BASE}

/* Define the initial values for state structures */
#define FEATURE_DSPI_INITIAL_STATE {NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL}

/* Define clock sources for SPI/DSPI instances */
#define FEATURE_DSPI_CLOCK_MAPPING {DSPI0_CLK, DSPI1_CLK, DSPI2_CLK, DSPI3_CLK, SPI0_CLK, SPI1_CLK,\
	                              SPI2_CLK, SPI3_CLK, SPI4_CLK, SPI5_CLK}

/* Define margins of instances interval */
#define DSPI_LOWEST_INSTANCE 0U
#define DSPI_HIGHEST_INSTANCE 3U
#define SPI_LOWEST_INSTANCE 4U
#define SPI_HIGHEST_INSTANCE 10U

/* On this platform DSPI in extended mode is supported */
#define FEATURE_DSPI_HAS_EXTENDED_MODE 0U

/* Define FIFO size */
#define DSPI_FIFO_SIZE 4U

/* RTC-API module features */
#define FEATURE_RTC_MINIMUM_API_VALUE (4UL)
#define FEATURE_RTC_SYNC_TICKS_VALUE  (6UL)

/* USDHC features */

/*! @brief USDHC peripheral clock names */
#define FEATURE_USDHC_CLOCK_NAMES { SDHC0_CLK }

/* MSCM module features */

/* @brief Has interrupt router control registers (IRSPRCn). */
#define FEATURE_MSCM_HAS_INTERRUPT_ROUTER                (0)
/* @brief Has directed CPU interrupt routerregisters (IRCPxxx). */
#define FEATURE_MSCM_HAS_CPU_INTERRUPT_ROUTER            (0)

/* STM module features */

/*! @brief STM module CR register has CSL bit-field */
#define FEATURE_STM_HAS_CLOCK_SELECTION                  (1U)


/* BCTU module features */

/*! @brief Number of ADC instances which can be triggered by BCTU */
#define FEATURE_BCTU_NUM_ADC                             (2u)

/* ADC module features */
#define FEATURE_ADC_HAS_CTU_TRIGGER_MODE (1)

#define ADC_PRESAMPLE_VSS_HV          (ADC_PRESAMPLE_SRC0)     /* Presampling from VSS_HV_ADC0 */
#define ADC_PRESAMPLE_VDD_HV_DIV_8    (ADC_PRESAMPLE_SRC1)     /* Presampling from VDD_HV/ 8 */
#define ADC_PRESAMPLE_VREFL 	      (ADC_PRESAMPLE_SRC2)     /* Presampling from VREFL */
#define ADC_PRESAMPLE_VDD_HV_ADC1_REF (ADC_PRESAMPLE_SRC3)     /* Presampling from VDD_HV ADC1 */

#define ADC_CLOCKS                    {ADC0_CLK, ADC1_CLK}

/* PIT module features */

/*! @brief PIT module has RTI channel */
#define FEATURE_PIT_HAS_RTI_CHANNEL (1U)

/* FCCU module features */
#define FEATURE_FCCU_UNLOCK_OP1                (0x913756AFU)
#define FEATURE_FCCU_UNLOCK_OP2                (0x825A132BU)
#define FEATURE_FCCU_UNLOCK_OP31               (0x29AF8752U)

#define FEATURE_FCCU_NCF_KEY                   (0xAB3498FEU)

