FARLY7/xcan-router/ECU_Engine_01/ECU_Engine_01_Z4_0/SDK/platform/devices/MPC5748G/include/MPC5748G_features.h
#define FEATURE_FCCU_IRQ_EN_MASK               (0x9U)

#define FEATURE_FCCU_TRANS_UNLOCK              (0xBCU)
#define FEATURE_FCCU_PERMNT_LOCK               (0xFFU)
#define FEATURE_FCCU_EINOUT_EOUTX_MASK         (FCCU_EINOUT_EOUTX_MASK)

#define FEATURE_FCCU_MAX_FAULTS_NO             (uint8_t)(71U)



/* WKPU module features */

/* @brief WKPU core source. */
typedef enum
{
    WKPU_CORE0       = 0U,    /*!< Core 0 */
    WKPU_CORE1       = 1U,    /*!< Core 1 */
    WKPU_CORE2       = 2U    /*!< Core 2 */
} wkpu_core_t;

/* @brief The WKPU core array */
#define FEATURE_WKPU_CORE_ARRAY      \
{                                    \
    WKPU_CORE0,    /*!< Core 0 */    \
    WKPU_CORE1,    /*!< Core 1 */    \
    WKPU_CORE2     /*!< Core 2 */    \
}

/*! @brief WKPU module support reset to MC_RGM */
#define FEATURE_WKPU_SUPPORT_RESET_REQUEST              (1U)
/*! @brief WKPU module support external interrupt */
#define FEATURE_WKPU_SUPPORT_INTERRUPT_REQUEST          (2U)
/*! @brief The number core support for WKPU module */
#define FEATURE_WKPU_NMI_NUM_CORES                      (3U)
/*! @brief The reset position */
#define FEATURE_WKPU_RESET_POSITION                     (3U)
/*! @brief The distance between cores */
#define FEATURE_WKPU_CORE_OFFSET_SIZE                   (8U)
/*! @brief The maximum channel count */
#define FEATURE_WKPU_MAX_CHANNEL_COUNT                  (32U)

#endif /* MPC5748G_FEATURES_H */

/*******************************************************************************
 * EOF
 ******************************************************************************/
